app/controllers/business_unit_controller.rb

SELECT * FROM "business_units" WHERE (name ILIKE E'software')
SELECT * FROM "business_units"
---
  def index
    @xml = ""
    xml = Builder::XmlMarkup.new(:target => @xml, :indent => 2 )
    xml.business_units {
      @units = BusinessUnit.find(:all)

      @units.each do |u|